## Question 1

`Write a query to calculate the running total of sales for each month in the year 2012, including months with no sales.`

(Hint: refer to invoices table. Use a combination of subqueries and join)

## Expected Output 
| InvoiceMonthFinal | TotalSales | RunningTotalSales |
| --- | --- | --- |
| January | 37.62 | 37.62 |
| February | 27.72 | 65.34 |
| March | 37.62 | 102.96 |
| April | 33.66 | 136.62 |
| May | 37.62 | 174.24 |
| June | 37.62 | 211.86 |
| July | 37.62 | 249.48 |
| August | 37.62 | 287.10 |
| September | 37.62 | 324.72 |
| October | 37.62 | 362.34 |
| November | 49.62 | 411.96 |
| December | 38.62 | 450.58 |

In [1]:
%run ../utils/setup_notebook.ipynb

In [2]:
%%sql 

SELECT * 
FROM invoices 
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98)]

In [3]:
%%sql 

SELECT * 
FROM invoice_items
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 1, 2, 0.99, 1)]

In [4]:
%%sql 

SELECT MONTH(i.InvoiceDate) AS InvoiceMonth,
    SUM(ii.UnitPrice * ii.Quantity) AS TotalSales
FROM invoices i 
JOIN invoice_items ii ON i.InvoiceId = ii.InvoiceId
WHERE YEAR(i.InvoiceDate) = 2013
GROUP BY MONTH(i.InvoiceDate)

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
12 rows affected.

[(1, 37.61999999999999),
 (2, 27.719999999999985),
 (3, 37.61999999999999),
 (4, 33.65999999999998),
 (5, 37.61999999999999),
 (6, 37.61999999999999),
 (7, 37.61999999999999),
 (8, 37.61999999999999),
 (9, 37.61999999999999),
 (10, 37.61999999999999),
 (11, 49.620000000000005),
 (12, 38.61999999999999)]

In [5]:
%%sql 

SELECT InvoiceMonth, TotalSales, 
    SUM(TotalSales) OVER (ORDER BY InvoiceMonth) AS RunningTotalSales 
FROM (
    SELECT MONTH(i.InvoiceDate) AS InvoiceMonth,
        SUM(ii.UnitPrice * ii.Quantity) AS TotalSales
    FROM invoices i 
    JOIN invoice_items ii ON i.InvoiceId = ii.InvoiceId
    WHERE YEAR(i.InvoiceDate) = 2013
    GROUP BY MONTH(i.InvoiceDate)
) AS SalesByMonth 
ORDER BY InvoiceMonth

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
12 rows affected.

[(1, 37.61999999999999, 37.61999999999999),
 (2, 27.719999999999985, 65.33999999999997),
 (3, 37.61999999999999, 102.95999999999997),
 (4, 33.65999999999998, 136.61999999999995),
 (5, 37.61999999999999, 174.23999999999995),
 (6, 37.61999999999999, 211.85999999999996),
 (7, 37.61999999999999, 249.47999999999996),
 (8, 37.61999999999999, 287.09999999999997),
 (9, 37.61999999999999, 324.71999999999997),
 (10, 37.61999999999999, 362.34),
 (11, 49.620000000000005, 411.96),
 (12, 38.61999999999999, 450.58)]

In [6]:
%%sql 
-- round up to 2 decimal points

SELECT InvoiceMonth, TotalSales, 
    ROUND(SUM(TotalSales) OVER (ORDER BY InvoiceMonth) , 2) AS RunningTotalSales 
FROM (
    SELECT MONTH(i.InvoiceDate) AS InvoiceMonth,
        ROUND(SUM(ii.UnitPrice * ii.Quantity), 2) AS TotalSales
    FROM invoices i 
    JOIN invoice_items ii ON i.InvoiceId = ii.InvoiceId
    WHERE YEAR(i.InvoiceDate) = 2013
    GROUP BY MONTH(i.InvoiceDate)
) AS SalesByMonth 
ORDER BY InvoiceMonth

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
12 rows affected.

[(1, 37.62, 37.62),
 (2, 27.72, 65.34),
 (3, 37.62, 102.96),
 (4, 33.66, 136.62),
 (5, 37.62, 174.24),
 (6, 37.62, 211.86),
 (7, 37.62, 249.48),
 (8, 37.62, 287.1),
 (9, 37.62, 324.72),
 (10, 37.62, 362.34),
 (11, 49.62, 411.96),
 (12, 38.62, 450.58)]

In [13]:
%%sql 
-- round up to 2 decimal points

SELECT 
    -- MONTHNAME(STR_TO_DATE(InvoiceMonth, '%m')) AS InvoiceMonthFinal, 
    -- DATE_FORMAT(STR_TO_DATE(InvoiceMonth, '%m'), '%M') AS InvoiceMonthFinal,
    DATE_FORMAT(STR_TO_DATE(CONCAT('2020-', InvoiceMonth, '-01'), '%Y-%m-%d'), '%M') AS InvoiceMonthFinal,
    TotalSales, 
    ROUND(SUM(TotalSales) OVER (ORDER BY InvoiceMonth) , 2) AS RunningTotalSales 
FROM (
    SELECT MONTH(i.InvoiceDate) AS InvoiceMonth,
        ROUND(SUM(ii.UnitPrice * ii.Quantity), 2) AS TotalSales
    FROM invoices i 
    JOIN invoice_items ii ON i.InvoiceId = ii.InvoiceId
    WHERE YEAR(i.InvoiceDate) = 2013
    GROUP BY MONTH(i.InvoiceDate)
) AS SalesByMonth 
ORDER BY InvoiceMonth

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
12 rows affected.

[('January', 37.62, 37.62),
 ('February', 27.72, 65.34),
 ('March', 37.62, 102.96),
 ('April', 33.66, 136.62),
 ('May', 37.62, 174.24),
 ('June', 37.62, 211.86),
 ('July', 37.62, 249.48),
 ('August', 37.62, 287.1),
 ('September', 37.62, 324.72),
 ('October', 37.62, 362.34),
 ('November', 49.62, 411.96),
 ('December', 38.62, 450.58)]

In [16]:
%%sql 

SELECT 
    DATE_FORMAT(STR_TO_DATE(CONCAT('2020-', InvoiceMonth, '-01'), '%Y-%m-%d'), '%M') AS InvoiceMonthFinal,
    TotalSales, 
    ROUND(SUM(TotalSales) OVER (ORDER BY InvoiceMonth) , 2) AS RunningTotalSales 
FROM (
    SELECT MONTH(i.InvoiceDate) AS InvoiceMonth,
        ROUND(SUM(ii.UnitPrice * ii.Quantity), 2) AS TotalSales
    FROM invoices i 
    JOIN invoice_items ii ON i.InvoiceId = ii.InvoiceId
    WHERE YEAR(i.InvoiceDate) = 2013
    GROUP BY MONTH(i.InvoiceDate)
) AS SalesByMonth 
ORDER BY InvoiceMonth

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
12 rows affected.

[('January', 37.62, 37.62),
 ('February', 27.72, 65.34),
 ('March', 37.62, 102.96),
 ('April', 33.66, 136.62),
 ('May', 37.62, 174.24),
 ('June', 37.62, 211.86),
 ('July', 37.62, 249.48),
 ('August', 37.62, 287.1),
 ('September', 37.62, 324.72),
 ('October', 37.62, 362.34),
 ('November', 49.62, 411.96),
 ('December', 38.62, 450.58)]